/* Завдання 1:*/
// function week(number) {
//     let message = +prompt('Введіть цифру від 1 до 7');
//     if (message) {
//         let weekDay;

//         switch(message) {
//             case 1 : weekDay = 'Понеділок'; break;
//             case 2 : weekDay = 'Вівторок'; break;
//             case 3 : weekDay = 'Середа'; break;
//             case 4 : weekDay = 'Четвер'; break;
//             case 5 : weekDay = 'П\'ятниця'; break;
//             case 6 : weekDay = 'Субота'; break;
//             case 7 : weekDay = 'Неділя'; break;
//             default: weekDay = `День тижня не визначений ${message}!`;
//         }

//         console.log(`Сьогодні ${message} день тижня - ${weekDay}`);
//     } else {
//         console.log('Ви не ввели день, або ввели не вірно !');
//     }
// }

// week();
// week();
// week();
// week();
// week();
// week();
// week();
// week();
/* Завдання 1:*/
/* Завдання 2:*/
let num = Number(prompt('Введіть довільне число'));

function integer(number) {
    if (num === parseInt(num)) {
        let message = 'Це число ціле';
        console.log(`${message}`);
    } else {
        let message = 'Це число дробове';
        console.log(`${message}`);
    }
}

integer();
// Задание 2:
// Напишите функцию, которая проверяет, является ли введенное с клавиатуры число — целым числом.
/* Завдання 2:*/
/* Завдання 3:*/

/* Завдання 3:*/
/* Завдання 4:*/

/* Завдання 4:*/
/* Завдання 5:*/

/* Завдання 5:*/
/* Завдання 6:*/

/* Завдання 6:*/
/* Завдання 7:*/

/* Завдання 7:*/
/* Завдання 8:*/

/* Завдання 8:*/
/* Завдання 9:*/

/* Завдання 9:*/
/* Завдання 10:*/

/* Завдання 10:*/



// Задание 3:
// Написать функцию которая возводит введенное с клавиатуры число, в степень n,  степень и число вводится с клавиатуры.

// Задание 4:
// Написать функцию, которая проверяет делится ли число 1 на число 2 без остачи.

// Задание 5:
// Напишите функцию, которая пишет в консоль число в заданном диапазоне.
// Используйте Math.random().

// Задание 6:
// Написать функцию isYearLeap, принимающую 1 аргумент — год, и возвращающую true, если год високосный, и false иначе.

// Подсказка ниже:
// Високосные года делятся нацело на 4. Однако из этого правила есть исключение: столетия, которые не делятся нацело на 400, високосными не являются.
// В високосном годе 366 дней, в обычном 365.

// Если год не делится на 4, значит он обычный.
// Иначе надо проверить не делится ли год на 100.
// Если не делится, значит это не столетие и можно сделать вывод, что год високосный.
// Если делится на 100, значит это столетие и его следует проверить его делимость на 400.
// Если год делится на 400, то он високосный.
// Иначе год обычный.

// Задание 7:
// Пользователь делает вклад в размере n рублей сроком на years лет под 10% годовых (каждый год размер его вклада увеличивается на 10%. Эти деньги прибавляются к сумме вклада, и на них в следующем году тоже будут проценты).

// Написать функцию bank, принимающая аргументы n и years, и возвращающую сумму, которая будет на счету пользователя.

// Задание 8:
// В зависимости от того, что выберет пользователь (ввести в prompt), вычислить площадь либо прямоугольника, либо треугольника, либо круга. Если выбраны прямоугольник или треугольник, то надо запросить длины сторон, если круг, то его радиус.
// Нужно написать 4 функции, по 1 для каждой фигуры и одна общая.